In [274]:
import urllib.request
from bs4 import BeautifulSoup
import pandas as pd
import datetime
import csv

from itertools import count
ctg1 = pd.read_csv('./날씨, 미세먼지 크롤링/ctg1.csv')
ctg2 = pd.read_csv('parent_ctg2.csv')
ctg3 = pd.read_csv('parent2_ctg3.csv')

In [275]:
ctg1.head()

      ctg1        id
0     패션의류  50000000
1     패션잡화  50000001
2   화장품/미용  50000002
3   디지털/가전  50000003
4  가구/인테리어  50000004

In [276]:
ctg2['parent_id'].unique()

array([50000000, 50000001, 50000002, 50000003, 50000004, 50000005,
       50000006, 50000150, 50000007, 50000008, 50000009, 50000010])

## 쿠키박스 정제

In [277]:
ctg2[ctg2['parent_id']==50000150]

     ctg2        id  parent_id
123  쿠킹박스  50006808   50000150

In [278]:
cookingbox = list(ctg2[ctg2['parent_id']==50000150].iloc[0])

In [279]:
cookingbox

['쿠킹박스', 50006808, 50000150]

In [280]:
ctg3.loc[len(ctg3)] = cookingbox

In [281]:
ctg3.loc[1814]

ctg3             쿠킹박스
id           50006808
parent_id    50000150
Name: 1814, dtype: object

In [282]:
ctg2 = ctg2[ctg2['ctg2']!='쿠킹박스']

In [283]:
ctg2[ctg2['ctg2']=='쿠킹박스']

Empty DataFrame
Columns: [ctg2, id, parent_id]
Index: []

In [285]:
ctg2[ctg2['ctg2']=='노트북']

   ctg2        id  parent_id
48  노트북  50000151   50000003

In [284]:
len(ctg2)

204

## 수영복 정제

In [286]:
for i in ctg3['parent_id']:
    if i in ctg1['id'].unique():
        print(i)

50000005

In [287]:
ctg3[ctg3['parent_id']==50000005]

      ctg3        id  parent_id
80  수영복/용품  50000140   50000005

In [288]:
swim = list(ctg3[ctg3['parent_id']==50000005].iloc[0])

In [289]:
ctg2.loc[205] = swim

In [290]:
ctg2.loc[205]

ctg2           수영복/용품
id           50000140
parent_id    50000005
Name: 205, dtype: object

In [291]:
ctg3 = ctg3[ctg3['ctg3'] != '수영복/용품']

In [292]:
ctg3.iloc[80]

ctg3             코디세트
id           50006828
parent_id    50000171
Name: 81, dtype: object

In [293]:
len(ctg3)

1814

## ctg2 옆에 ctg1 이름 붙이기

In [294]:
ctg1dict = dict(zip(ctg1['id'],ctg1['ctg1']))

In [295]:
ctg1dict[50000000]

'패션의류'

In [296]:
ctg1forctg2 = []

for i in ctg2['parent_id']:
    ctg1forctg2.append(ctg1dict[i])

ctg2['ctg1'] = ctg1forctg2

In [297]:
ctg2.head()

        ctg2        id  parent_id  ctg1
0       여성의류  50000167   50000000  패션의류
1  여성언더웨어/잠옷  50000168   50000000  패션의류
2       남성의류  50000169   50000000  패션의류
3  남성언더웨어/잠옷  50000170   50000000  패션의류
4       아동의류  50000171   50000000  패션의류

In [298]:
ctg2.to_csv('ctg2_final.csv',index=False,index_label=False)

# ctg3 옆에 ctg2 붙이기

In [299]:
ctg3['parent_id'].nunique()

194

In [300]:
ctg2dict = dict(zip(ctg2['id'],ctg2['ctg2']))

In [301]:
ctg2forctg3 = []

for i in ctg3['parent_id']:
    try:
        ctg2forctg3.append(ctg2dict[i])
    except:
        print(i)

50000892
50000943
50000933
50006808
50006808
50006808
50006808
50006808
50006808
50006808
50006808

In [302]:
ctg3[ctg3['parent_id']==50006808]

        ctg3        id  parent_id
1204     밥/죽  50006809   50006808
1205    찌개/국  50006810   50006808
1206   면/파스타  50006811   50006808
1207      구이  50006812   50006808
1208   볶음/튀김  50006813   50006808
1209    조림/찜  50006814   50006808
1210  간식/디저트  50006815   50006808
1211    세트요리  50006816   50006808

In [303]:
ctg3[ctg3['parent_id']==50000933]

    ctg3        id  parent_id
727  시트지  50003913   50000933

In [304]:
ctg3[ctg3['parent_id']==50000943]

    ctg3        id  parent_id
724   몰딩  50004081   50000943

In [305]:
ctg3[ctg3['parent_id']==50000892]

    ctg3        id  parent_id
678  와인랙  50004801   50000892

In [306]:
ctg4 = ctg3.loc[[678,724,727,1204,1205,1206,1207,1208,1209,1210,1211]]

In [307]:
ctg4

        ctg3        id  parent_id
678      와인랙  50004801   50000892
724       몰딩  50004081   50000943
727      시트지  50003913   50000933
1204     밥/죽  50006809   50006808
1205    찌개/국  50006810   50006808
1206   면/파스타  50006811   50006808
1207      구이  50006812   50006808
1208   볶음/튀김  50006813   50006808
1209    조림/찜  50006814   50006808
1210  간식/디저트  50006815   50006808
1211    세트요리  50006816   50006808

In [308]:
for i in [50000892,50000943,50000933,50006808]:
    ctg3 = ctg3[ctg3['parent_id'] != i]

#ctg3[ctg3['parent_id']!=[i for i in [50000892,50000943]]]

In [309]:
ctg3[ctg3['ctg3']=='몰딩']

Empty DataFrame
Columns: [ctg3, id, parent_id]
Index: []

In [310]:
ctg3[ctg3['ctg3']=='와인랙']

Empty DataFrame
Columns: [ctg3, id, parent_id]
Index: []

In [311]:
ctg3[ctg3['parent_id']==50000892]

Empty DataFrame
Columns: [ctg3, id, parent_id]
Index: []

In [312]:
ctg2forctg3 = []

for i in ctg3['parent_id']:
    ctg2forctg3.append(ctg2dict[i])

ctg3['ctg2'] = ctg2forctg3

In [313]:
ctg3.head()

      ctg3        id  parent_id  ctg2
0   니트/스웨터  50000805   50000167  여성의류
1      카디건  50000806   50000167  여성의류
2      원피스  50000807   50000167  여성의류
3      티셔츠  50000803   50000167  여성의류
4  블라우스/셔츠  50000804   50000167  여성의류

In [242]:
p_ctg2dict2 = dict(zip(ctg2['id'],ctg2['parent_id']))

In [245]:
p_ctg2dict2[50000167]

50000000

In [247]:
ctg1forctg3 = []

for i in ctg3['parent_id']:
    ctg1forctg3.append(p_ctg2dict2[i])

ctg3['ctg1_id'] = ctg1forctg3

In [248]:
ctg3.head()

      ctg3        id  parent_id  ctg2   ctg1_id
0   니트/스웨터  50000805   50000167  여성의류  50000000
1      카디건  50000806   50000167  여성의류  50000000
2      원피스  50000807   50000167  여성의류  50000000
3      티셔츠  50000803   50000167  여성의류  50000000
4  블라우스/셔츠  50000804   50000167  여성의류  50000000

In [249]:
ctg1dict = dict(zip(ctg1['id'],ctg1['ctg1']))

In [250]:
ctg1forctg3 = []

for i in ctg3['ctg1_id']:
    ctg1forctg3.append(ctg1dict[i])

ctg3['ctg1'] = ctg1forctg3

In [251]:
ctg3.head()

      ctg3        id  parent_id  ctg2   ctg1_id  ctg1
0   니트/스웨터  50000805   50000167  여성의류  50000000  패션의류
1      카디건  50000806   50000167  여성의류  50000000  패션의류
2      원피스  50000807   50000167  여성의류  50000000  패션의류
3      티셔츠  50000803   50000167  여성의류  50000000  패션의류
4  블라우스/셔츠  50000804   50000167  여성의류  50000000  패션의류

In [252]:
ctg3.columns=['ctg3','ctg3_id','ctg2_id','ctg2','ctg1_id','ctg1']

In [258]:
my_order =['ctg3','ctg3_id','ctg2','ctg2_id','ctg1','ctg1_id']

ctg3 = ctg3[my_order]

In [259]:
ctg3.head()

      ctg3   ctg3_id  ctg2   ctg2_id  ctg1   ctg1_id
0   니트/스웨터  50000805  여성의류  50000167  패션의류  50000000
1      카디건  50000806  여성의류  50000167  패션의류  50000000
2      원피스  50000807  여성의류  50000167  패션의류  50000000
3      티셔츠  50000803  여성의류  50000167  패션의류  50000000
4  블라우스/셔츠  50000804  여성의류  50000167  패션의류  50000000

In [260]:
ctg3.to_csv('ctg3_final.csv',index=False,index_label=False)


-------
------
------
------
------

In [263]:
ctg3['ctg2'].unique()

array(['여성의류', '수영', '여성언더웨어/잠옷', '남성의류', '남성언더웨어/잠옷', '아동의류',
       '아동언더웨어/잠옷', '여성신발', '남성신발', '지갑', '여행용가방/소품', '신발용품', '여성가방',
       '남성가방', '헤어액세서리', '모자', '패션소품', '주얼리', '순금', '장갑', '벨트', '베이비주얼리',
       '양말', '선글라스/안경테', '시계', '스킨케어', '선케어', '클렌징', '베이스메이크업', '색조메이크업',
       '뷰티소품', '마스크/팩', '네일케어', '향수', '바디케어', '헤어케어', '헤어스타일링', '남성화장품',
       '휴대폰', '휴대폰 액세서리', '카메라/캠코더용품', '광학기기/용품', '영상가전', '계절가전', '음향가전',
       '생활가전', '이미용가전', '자동차기기', 'PC', 'PC부품', 'PC액세서리', '모니터주변기기',
       '태블릿PC액세서리', '노트북액세서리', '주방가전', '멀티미디어장비', '소프트웨어', '네트워크장비',
       'PC주변기기', '학습기기', '저장장치', '게임기/타이틀', '침실가구', '거실가구', '주방가구',
       '수납가구', '아동/주니어가구', '서재/사무용가구', '아웃도어가구', '캠핑', 'DIY자재/용품', '침구단품',
       '침구세트', '카페트/러그', '커튼/블라인드', '홈데코', '솜류', '수예', '인테리어소품', '분유',
       '기저귀', '물티슈', '이유식', '수유용품', '간식/건강식품', '유모차', '카시트', '외출용품',
       '목욕용품', '스킨/바디용품', '위생/건강용품', '유아세제', '구강청결용품', '소독/살균용품', '안전용품',
       '임산부용품', '유아침구', '이유식용품', '유아가구', '임부복', '출산/돌기념품', '신생아의류',
       '유아의류', '완구/매트', '유아잡화', '인형', '수영복/용품', '교재/서적', '유아발육용품', '축산',
       '건강식품', '수산', '농산물', '반찬', '김치', '음료', '가공식품', '다이어트식품', '과자',
       '아이스크림/빙수', '냉동/간편조리식품', '전통주', '등산', '스포츠액세서리', '골프', '스키/보드',
       '자전거', '낚시', '헬스', '오토바이/스쿠터', '스케이트/보드/롤러', '인라인스케이트', '요가/필라테스',
       '축구', '야구', '농구', '배구', '탁구', '배드민턴', '스킨스쿠버', '검도', '테니스', '스쿼시',
       '족구', '볼링', '댄스', '권투', '보호용품', '수련용품', '무술용품', '공구', '문구/사무용품',
       '화방용품', '관상어용품', '수집품', '자동차용품', '악기', 'DVD', '음반', '반려동물', '종교',
       '욕실용품', '세탁용품', '건강측정용품', '건강관리용품', '당뇨관리용품', '좌욕/좌훈용품', '주방용품',
       '의료용품', '냉온/찜질용품', '재활운동용품', '눈건강용품', '실버용품', '물리치료/저주파용품',
       '구강위생용품', '발건강용품', '생활용품', '안마용품', '수납/정리용품', '청소용품', '원예/식물',
       '블루레이', '정원/원예용품', '공연/티켓', '꽃/케이크배달', '지류/카드상품권', '모바일쿠폰/상품권',
       '레저이용권', '여행/항공권', 'e컨텐츠'], dtype=object)

In [267]:
ctg3[ctg3.duplicated('ctg3',keep=False)]['ctg2'].unique()

array(['여성의류', '수영', '여성언더웨어/잠옷', '남성의류', '남성언더웨어/잠옷', '아동의류',
       '아동언더웨어/잠옷', '여성신발', '남성신발', '여성가방', '남성가방', '헤어액세서리', '모자',
       '패션소품', '주얼리', '베이비주얼리', '선글라스/안경테', '스킨케어', '선케어', '클렌징', '뷰티소품',
       '네일케어', '바디케어', '헤어케어', '남성화장품', '생활가전', '이미용가전', 'PC부품', '침실가구',
       '거실가구', '수납가구', '아동/주니어가구', '서재/사무용가구', '캠핑', '인테리어소품', '물티슈',
       '스킨/바디용품', '유아세제', '안전용품', '임부복', '유아의류', '유아잡화', '아이스크림/빙수',
       '냉동/간편조리식품', '스키/보드', '야구', '배드민턴', '스킨스쿠버', '테니스', '권투', '보호용품',
       '공구', '관상어용품', '자동차용품', 'DVD', '건강관리용품', '재활운동용품', '구강위생용품',
       '블루레이', '모바일쿠폰/상품권'], dtype=object)

In [262]:
g = re.compile(r"(여|남|유아|베이비|유아)")
kids_onepiece = []

for ind, i in enumerate(search_op['KWD_NM']):
    m = g.search(search_op.iloc[ind]['KWD_NM'])
    if m:
        kids_onepiece.append(1)
    else:
        kids_onepiece.append(0)

0            여성의류
1            여성의류
2            여성의류
3            여성의류
4            여성의류
5            여성의류
6            여성의류
7            여성의류
8            여성의류
9            여성의류
10           여성의류
11           여성의류
12           여성의류
13           여성의류
14           여성의류
15           여성의류
16           여성의류
17           여성의류
18           여성의류
19           여성의류
20           여성의류
21             수영
22             수영
23      여성언더웨어/잠옷
24      여성언더웨어/잠옷
25      여성언더웨어/잠옷
26      여성언더웨어/잠옷
27      여성언더웨어/잠옷
28      여성언더웨어/잠옷
29      여성언더웨어/잠옷
          ...
1785    모바일쿠폰/상품권
1786    모바일쿠폰/상품권
1787    모바일쿠폰/상품권
1788    모바일쿠폰/상품권
1789    모바일쿠폰/상품권
1790    모바일쿠폰/상품권
1791        레저이용권
1792        레저이용권
1793        레저이용권
1794        레저이용권
1795        레저이용권
1796        레저이용권
1797        레저이용권
1798        레저이용권
1799        레저이용권
1800        레저이용권
1801       여행/항공권
1802       여행/항공권
1803       여행/항공권
1804       여행/항공권
1805       여행/항공권
1806       여행/항공권
1807       여행/항공권
1808         e컨텐츠
1809         e컨텐츠
1810         e컨텐츠
1811         e컨텐츠
1812         e컨텐츠
1813         e컨텐츠
1814         가공식품
Name: ctg2, Length: 1803, dtype: object